logs/sshfs_fio/fio-randread.log
job-randr: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.16
Starting 1 process
3;fio-3.16;job-randr;0;0;2097152;10904;2726;192325;178;1127317;364.137949;1684.469961;1;2090265;11372.142762;15652.093942;1.000000%=8847;5.000000%=9502;10.000000%=9764;20.000000%=10158;30.000000%=10420;40.000000%=10682;50.000000%=10944;60.000000%=11206;70.000000%=11468;80.000000%=11862;90.000000%=12517;95.000000%=13434;99.000000%=16711;99.500000%=19791;99.900000%=44826;99.950000%=109576;99.990000%=463470;0%=0;0%=0;0%=0;218;2094295;11736.647753;15973.206760;40;13712;100.000000%;10926.013055;1627.601660;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1.000915%;1.219817%;524413;0;42;0.1%;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.00%;0.01%;0.01%;0.01%;0.01%;15.66%;83.85%;0.40%;0.03%;0.04%;0.01%;0.01%;0.01%;0.01%;0.01%

job-randr: (groupid=0, jobs=1): err= 0: pid=3124: Wed Sep 29 15:34:40 2021
  read: IOPS=2726, BW=10.6MiB/s (11.2MB/s)(2048MiB/192325msec)
    slat (usec): min=178, max=1127.3k, avg=364.14, stdev=1684.47
    clat (nsec): min=1909, max=2090.3M, avg=11372142.76, stdev=15652093.94
     lat (usec): min=218, max=2094.3k, avg=11736.65, stdev=15973.21
    clat percentiles (msec):
     |  1.00th=[    9],  5.00th=[   10], 10.00th=[   10], 20.00th=[   11],
     | 30.00th=[   11], 40.00th=[   11], 50.00th=[   11], 60.00th=[   12],
     | 70.00th=[   12], 80.00th=[   12], 90.00th=[   13], 95.00th=[   14],
     | 99.00th=[   17], 99.50th=[   20], 99.90th=[   45], 99.95th=[  110],
     | 99.99th=[  464]
   bw (  KiB/s): min=   40, max=13712, per=100.00%, avg=10926.01, stdev=1627.60, samples=383
   iops        : min=   10, max= 3428, avg=2731.49, stdev=406.90, samples=383
  lat (usec)   : 2=0.01%, 250=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=15.66%, 20=83.85%, 50=0.40%
  lat (msec)   : 100=0.03%, 250=0.04%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2000=0.01%, >=2000=0.01%
  cpu          : usr=1.00%, sys=1.22%, ctx=524413, majf=0, minf=42
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=524288,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=10.6MiB/s (11.2MB/s), 10.6MiB/s-10.6MiB/s (11.2MB/s-11.2MB/s), io=2048MiB (2147MB), run=192325-192325msec