logs/sshfs_fio/fio-randwrite.log
job-randw: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.16
Starting 1 process
3;fio-3.16;job-randw;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;2097152;109563;27390;19141;8;12176;34.814166;63.957651;1;13674;1132.253663;219.408397;1.000000%=782;5.000000%=921;10.000000%=978;20.000000%=1028;30.000000%=1056;40.000000%=1089;50.000000%=1122;60.000000%=1155;70.000000%=1171;80.000000%=1220;90.000000%=1286;95.000000%=1368;99.000000%=1630;99.500000%=1712;99.900000%=3194;99.950000%=3981;99.990000%=12648;0%=0;0%=0;0%=0;11;13786;1167.332145;220.681101;102480;115208;99.996205%;109558.842105;2858.258055;6.175549%;10.893417%;524348;0;10;0.1%;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.01%;0.00%;0.00%;0.01%;0.01%;0.01%;0.01%;0.24%;0.59%;13.03%;85.93%;0.16%;0.04%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%

job-randw: (groupid=0, jobs=1): err= 0: pid=3119: Wed Sep 29 15:31:23 2021
  write: IOPS=27.4k, BW=107MiB/s (112MB/s)(2048MiB/19141msec); 0 zone resets
    slat (usec): min=8, max=12176, avg=34.81, stdev=63.96
    clat (nsec): min=1349, max=13674k, avg=1132253.66, stdev=219408.40
     lat (usec): min=11, max=13786, avg=1167.33, stdev=220.68
    clat percentiles (usec):
     |  1.00th=[  783],  5.00th=[  922], 10.00th=[  979], 20.00th=[ 1029],
     | 30.00th=[ 1057], 40.00th=[ 1090], 50.00th=[ 1123], 60.00th=[ 1156],
     | 70.00th=[ 1172], 80.00th=[ 1221], 90.00th=[ 1287], 95.00th=[ 1369],
     | 99.00th=[ 1631], 99.50th=[ 1713], 99.90th=[ 3195], 99.95th=[ 3982],
     | 99.99th=[12649]
   bw (  KiB/s): min=102480, max=115208, per=100.00%, avg=109558.84, stdev=2858.26, samples=38
   iops        : min=25620, max=28802, avg=27389.68, stdev=714.57, samples=38
  lat (usec)   : 2=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
  lat (usec)   : 500=0.24%, 750=0.59%, 1000=13.03%
  lat (msec)   : 2=85.93%, 4=0.16%, 10=0.04%, 20=0.01%
  cpu          : usr=6.18%, sys=10.89%, ctx=524348, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,524288,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=107MiB/s (112MB/s), 107MiB/s-107MiB/s (112MB/s-112MB/s), io=2048MiB (2147MB), run=19141-19141msec