logs/sshfs_fio/fio-read.log
job-r: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=4
fio-3.16
Starting 1 process
3;fio-3.16;job-r;0;0;2097152;113870;889;18417;948;20989;1121.106191;378.989214;2;23322;3372.373202;674.349314;1.000000%=3031;5.000000%=3063;10.000000%=3096;20.000000%=3162;30.000000%=3194;40.000000%=3227;50.000000%=3260;60.000000%=3293;70.000000%=3358;80.000000%=3457;90.000000%=3588;95.000000%=3751;99.000000%=5799;99.500000%=7110;99.900000%=11206;99.950000%=18219;99.990000%=23199;0%=0;0%=0;0%=0;1010;24551;4493.898111;785.979524;105216;121600;100.000000%;113984.583333;4064.031653;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.282363%;0.651607%;16385;0;138;0.1%;0.1%;100.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;96.98%;2.88%;0.11%;0.02%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%

job-r: (groupid=0, jobs=1): err= 0: pid=3113: Wed Sep 29 15:30:58 2021
  read: IOPS=889, BW=111MiB/s (117MB/s)(2048MiB/18417msec)
    slat (usec): min=948, max=20989, avg=1121.11, stdev=378.99
    clat (usec): min=2, max=23322, avg=3372.37, stdev=674.35
     lat (usec): min=1010, max=24551, avg=4493.90, stdev=785.98
    clat percentiles (usec):
     |  1.00th=[ 3032],  5.00th=[ 3064], 10.00th=[ 3097], 20.00th=[ 3163],
     | 30.00th=[ 3195], 40.00th=[ 3228], 50.00th=[ 3261], 60.00th=[ 3294],
     | 70.00th=[ 3359], 80.00th=[ 3458], 90.00th=[ 3589], 95.00th=[ 3752],
     | 99.00th=[ 5800], 99.50th=[ 7111], 99.90th=[11207], 99.95th=[18220],
     | 99.99th=[23200]
   bw (  KiB/s): min=105216, max=121600, per=100.00%, avg=113984.58, stdev=4064.03, samples=36
   iops        : min=  822, max=  950, avg=890.50, stdev=31.75, samples=36
  lat (usec)   : 4=0.01%
  lat (msec)   : 2=0.01%, 4=96.98%, 10=2.88%, 20=0.11%, 50=0.02%
  cpu          : usr=0.28%, sys=0.65%, ctx=16385, majf=0, minf=138
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16384,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=111MiB/s (117MB/s), 111MiB/s-111MiB/s (117MB/s-117MB/s), io=2048MiB (2147MB), run=18417-18417msec