logs/sshfs_fio/fio-write.log
job-w: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=4
fio-3.16
Starting 1 process
job-w: Laying out IO file (1 file / 2048MiB)
3;fio-3.16;job-w;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;2097152;128667;1005;16299;50;248315;991.641525;4780.915993;2;250503;2985.138922;8274.289350;1.000000%=1548;5.000000%=1974;10.000000%=2072;20.000000%=2211;30.000000%=2310;40.000000%=2441;50.000000%=2506;60.000000%=2572;70.000000%=2637;80.000000%=2736;90.000000%=3096;95.000000%=4079;99.000000%=7110;99.500000%=13303;99.900000%=204472;99.950000%=208666;99.990000%=250609;0%=0;0%=0;0%=0;353;251611;3977.239592;9549.418253;60672;155648;99.854202%;128479.406250;28187.477676;0.779237%;0.748558%;16387;0;12;0.1%;0.1%;100.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.15%;0.12%;0.16%;5.13%;89.15%;4.66%;0.45%;0.03%;0.00%;0.13%;0.01%;0.00%;0.00%;0.00%;0.00%

job-w: (groupid=0, jobs=1): err= 0: pid=3103: Wed Sep 29 15:30:34 2021
  write: IOPS=1005, BW=126MiB/s (132MB/s)(2048MiB/16299msec); 0 zone resets
    slat (usec): min=50, max=248315, avg=991.64, stdev=4780.92
    clat (usec): min=2, max=250503, avg=2985.14, stdev=8274.29
     lat (usec): min=353, max=251611, avg=3977.24, stdev=9549.42
    clat percentiles (usec):
     |  1.00th=[  1549],  5.00th=[  1975], 10.00th=[  2073], 20.00th=[  2212],
     | 30.00th=[  2311], 40.00th=[  2442], 50.00th=[  2507], 60.00th=[  2573],
     | 70.00th=[  2638], 80.00th=[  2737], 90.00th=[  3097], 95.00th=[  4080],
     | 99.00th=[  7111], 99.50th=[ 13304], 99.90th=[204473], 99.95th=[208667],
     | 99.99th=[250610]
   bw (  KiB/s): min=60672, max=155648, per=99.85%, avg=128479.41, stdev=28187.48, samples=32
   iops        : min=  474, max= 1216, avg=1003.72, stdev=220.20, samples=32
  lat (usec)   : 4=0.01%, 500=0.15%, 750=0.12%, 1000=0.16%
  lat (msec)   : 2=5.13%, 4=89.15%, 10=4.66%, 20=0.45%, 50=0.03%
  lat (msec)   : 250=0.13%, 500=0.01%
  cpu          : usr=0.78%, sys=0.75%, ctx=16387, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16384,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
  WRITE: bw=126MiB/s (132MB/s), 126MiB/s-126MiB/s (132MB/s-132MB/s), io=2048MiB (2147MB), run=16299-16299msec